<a href="https://colab.research.google.com/github/rogemaro/Data-With-Python-And-Pandas/blob/main/7_Aggregation_%2C_Group_By_%26_Pivot_Table.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
pd.__version__

'1.1.5'

In [ ]:
pd.options.display.float_format = "{:,.3f}".format

In [ ]:
import seaborn as sns

In [ ]:
df = sns.load_dataset("tips")
df

     total_bill   tip     sex smoker   day    time  size
0        16.990 1.010  Female     No   Sun  Dinner     2
1        10.340 1.660    Male     No   Sun  Dinner     3
2        21.010 3.500    Male     No   Sun  Dinner     3
3        23.680 3.310    Male     No   Sun  Dinner     2
4        24.590 3.610  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239      29.030 5.920    Male     No   Sat  Dinner     3
240      27.180 2.000  Female    Yes   Sat  Dinner     2
241      22.670 2.000    Male    Yes   Sat  Dinner     2
242      17.820 1.750    Male     No   Sat  Dinner     2
243      18.780 3.000  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
df.describe(include="all")

        total_bill     tip   sex smoker  day    time    size
count      244.000 244.000   244    244  244     244 244.000
unique         nan     nan     2      2    4       2     nan
top            nan     nan  Male     No  Sat  Dinner     nan
freq           nan     nan   157    151   87     176     nan
mean        19.786   2.998   NaN    NaN  NaN     NaN   2.570
std          8.902   1.384   NaN    NaN  NaN     NaN   0.951
min          3.070   1.000   NaN    NaN  NaN     NaN   1.000
25%         13.348   2.000   NaN    NaN  NaN     NaN   2.000
50%         17.795   2.900   NaN    NaN  NaN     NaN   2.000
75%         24.127   3.562   NaN    NaN  NaN     NaN   3.000
max         50.810  10.000   NaN    NaN  NaN     NaN   6.000

In [ ]:
df["day"].value_counts() #contamos los datos por categoria de dias

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [ ]:
df["day"].value_counts() / df["day"].value_counts().sum() *100 #traemos los valores de los dias en porcentajes

Sat    35.656
Sun    31.148
Thur   25.410
Fri     7.787
Name: day, dtype: float64

In [ ]:
df.groupby("sex").mean() #aplicamos el promedio a la variable sex

        total_bill   tip  size
sex
Male        20.744 3.090 2.631
Female      18.057 2.833 2.460

In [ ]:
df["prct_tip"] = df["tip"] / df["total_bill"] #creamos una columna que nos va a gurdar que porcentaje del total de la cuenta corresponde a propinas
df

     total_bill   tip     sex smoker   day    time  size  prct_tip
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147
..          ...   ...     ...    ...   ...     ...   ...       ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160

[244 rows x 8 columns]

In [ ]:
df.groupby("sex").mean()

        total_bill   tip  size  prct_tip
sex
Male        20.744 3.090 2.631     0.158
Female      18.057 2.833 2.460     0.166

In [ ]:
df.groupby("sex").median() #aplicamos la mediana al grupo sex

        total_bill   tip  size  prct_tip
sex
Male        18.350 3.000     2     0.153
Female      16.400 2.750     2     0.156

In [ ]:
df.groupby("sex")[["prct_tip"]].describe() # creamos el grupo sex, del cual vamos a describir la variable prct_tip

       prct_tip
          count  mean   std   min   25%   50%   75%   max
sex
Male    157.000 0.158 0.065 0.036 0.121 0.153 0.186 0.710
Female   87.000 0.166 0.054 0.056 0.140 0.156 0.194 0.417

In [ ]:
df.groupby("sex")[["prct_tip", "total_bill"]].describe() #Realizamos el mismo proceso de descripción agregandole el total de la cuenta

       prct_tip                          ... total_bill
          count  mean   std   min   25%  ...        min    25%    50%    75%    max
sex                                      ...
Male    157.000 0.158 0.065 0.036 0.121  ...      7.250 14.000 18.350 24.710 50.810
Female   87.000 0.166 0.054 0.056 0.140  ...      3.070 12.750 16.400 21.520 44.300

[2 rows x 16 columns]

Ahora si quisieramos aplicar una función directamente, procedemos de la siguiente manera

In [ ]:
def mean_eur2usd(x):
  y = np.mean(x) * 1.12
  return y

#creamos una función que calcule el promedio transformado de euros a dolares

In [ ]:
df.groupby("sex")[["prct_tip", "total_bill"]].apply(mean_eur2usd) #aplicamos la anterior función al grupo sex

        prct_tip  total_bill
sex
Male       0.177      23.233
Female     0.186      20.224

In [ ]:
df.groupby(["sex", "time"])[["prct_tip", "total_bill"]].apply(mean_eur2usd) # aplicamos la misma función pero ahora agrupado por más categorias

               prct_tip  total_bill
sex    time
Male   Lunch      0.186      20.214
       Dinner     0.174      24.037
Female Lunch      0.182      18.300
       Dinner     0.190      21.519

Cuando utilizamos apply podemos aplicar las funciones que nosotros hayamos definido o las que nos proporciona pandas o numpy

In [ ]:
df.groupby(["sex", "time"])[["prct_tip", "total_bill"]].apply(np.std)

               prct_tip  total_bill
sex    time
Male   Lunch      0.045       7.832
       Dinner     0.069       9.423
Female Lunch      0.034       7.393
       Dinner     0.063       8.123

También podemos aplicar una función directamente con una lambda

In [ ]:
df.groupby(["sex", "time"])[["prct_tip", "total_bill"]].apply(lambda x: np.mean(x)*1.12) #aplicamos la función que transforma de euros a dolares

               prct_tip  total_bill
sex    time
Male   Lunch      0.186      20.214
       Dinner     0.174      24.037
Female Lunch      0.182      18.300
       Dinner     0.190      21.519

Si queremos aplicar más de una función recurrimos a aggregate

In [ ]:
df.groupby(["sex", "time"])[["prct_tip", "total_bill"]].aggregate([np.mean, np.max, np.median])

              prct_tip              total_bill
                  mean  amax median       mean   amax median
sex    time
Male   Lunch     0.166 0.266  0.157     18.048 41.190 16.580
       Dinner    0.155 0.710  0.151     21.461 50.810 19.630
Female Lunch     0.162 0.259  0.154     16.339 43.110 13.420
       Dinner    0.169 0.417  0.161     19.213 44.300 17.190

Con aggregate también podemos definir funciones enfocadas en una cada categoria que deseemos

In [ ]:
dict_agg = {"tip":[min, max], "total_bill":[np.mean, mean_eur2usd]} #definimos un diccionario donde a la variable tip se le va a plicar min y mx y total bill el promedio y la función que creamos previamente

In [ ]:
df.groupby(["sex", "time"])[["total_bill", "tip"]].agg(dict_agg)

                tip        total_bill
                min    max       mean mean_eur2usd
sex    time
Male   Lunch  1.440  6.700     18.048       20.214
       Dinner 1.000 10.000     21.461       24.037
Female Lunch  1.250  5.170     16.339       18.300
       Dinner 1.000  6.500     19.213       21.519

También podemos definir filtros

In [ ]:
def f_filter(x):
  return mean_eur2usd(x["total_bill"].mean()) > 20 # creamos un filtro para que nos calcule el promedio de la función que definimos donde el promedio sea mayor a 20

In [ ]:
df_filtered = df.groupby(["sex", "time"]).filter(f_filter)
df_filtered

     total_bill   tip     sex smoker   day    time  size  prct_tip
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147
..          ...   ...     ...    ...   ...     ...   ...       ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160

[209 rows x 8 columns]

Vamos a crear un columna de unos que nos va a ayudar a realizar conteos en variables categoricas

In [ ]:
df["ones"] = 1
df

     total_bill   tip     sex smoker   day    time  size  prct_tip  ones
0        16.990 1.010  Female     No   Sun  Dinner     2     0.059     1
1        10.340 1.660    Male     No   Sun  Dinner     3     0.161     1
2        21.010 3.500    Male     No   Sun  Dinner     3     0.167     1
3        23.680 3.310    Male     No   Sun  Dinner     2     0.140     1
4        24.590 3.610  Female     No   Sun  Dinner     4     0.147     1
..          ...   ...     ...    ...   ...     ...   ...       ...   ...
239      29.030 5.920    Male     No   Sat  Dinner     3     0.204     1
240      27.180 2.000  Female    Yes   Sat  Dinner     2     0.074     1
241      22.670 2.000    Male    Yes   Sat  Dinner     2     0.088     1
242      17.820 1.750    Male     No   Sat  Dinner     2     0.098     1
243      18.780 3.000  Female     No  Thur  Dinner     2     0.160     1

[244 rows x 9 columns]

In [ ]:
df_g = df.groupby(["sex", "smoker"])[["ones"]].sum() #al tener la variable ones podemos realizar sumas totales de las categorias
df_g

               ones
sex    smoker
Male   Yes       60
       No        97
Female Yes       33
       No        54

In [ ]:
df_g.groupby(level=0).apply(
    lambda x:
    x / x.sum() * 100
) #aplicamos porcentajes a los resultados anteriores

                ones
sex    smoker
Male   Yes    38.217
       No     61.783
Female Yes    37.931
       No     62.069

Para extraer valor de nuestras variables continuas, podemos transformarlas en intervalos categoricos

In [ ]:
pd.cut(df["total_bill"], bins = 3).value_counts() #allí le especificamos que queremos 3 categorias y de cada una de ellas hace la sumatoria de los valores

(3.022, 18.983]     140
(18.983, 34.897]     88
(34.897, 50.81]      16
Name: total_bill, dtype: int64

También podemos definir los intervalos de nuestras categorias

In [ ]:
pd.cut(df["total_bill"], bins = [3, 18, 35, 60]).value_counts()

(3, 18]     127
(18, 35]    101
(35, 60]     16
Name: total_bill, dtype: int64

Vamos a almacenar nuestras categorias dentro de una nueva variable en nuestro data frame

In [ ]:
df["bin_total"] = pd.cut(df["total_bill"], bins = [3, 18, 35, 60])
df

     total_bill   tip     sex smoker  ... size prct_tip  ones  bin_total
0        16.990 1.010  Female     No  ...    2    0.059     1    (3, 18]
1        10.340 1.660    Male     No  ...    3    0.161     1    (3, 18]
2        21.010 3.500    Male     No  ...    3    0.167     1   (18, 35]
3        23.680 3.310    Male     No  ...    2    0.140     1   (18, 35]
4        24.590 3.610  Female     No  ...    4    0.147     1   (18, 35]
..          ...   ...     ...    ...  ...  ...      ...   ...        ...
239      29.030 5.920    Male     No  ...    3    0.204     1   (18, 35]
240      27.180 2.000  Female    Yes  ...    2    0.074     1   (18, 35]
241      22.670 2.000    Male    Yes  ...    2    0.088     1   (18, 35]
242      17.820 1.750    Male     No  ...    2    0.098     1    (3, 18]
243      18.780 3.000  Female     No  ...    2    0.160     1   (18, 35]

[244 rows x 10 columns]

Ahora podemos aplicar group by a nuestra nueva categoria

In [ ]:
df.groupby(["time", "bin_total"])[["ones"]].count()

                  ones
time   bin_total
Lunch  (3, 18]      45
       (18, 35]     21
       (35, 60]      2
Dinner (3, 18]      82
       (18, 35]     80
       (35, 60]     14

# **Pivot Table**

In [ ]:
df

     total_bill   tip     sex smoker  ... size prct_tip  ones  bin_total
0        16.990 1.010  Female     No  ...    2    0.059     1    (3, 18]
1        10.340 1.660    Male     No  ...    3    0.161     1    (3, 18]
2        21.010 3.500    Male     No  ...    3    0.167     1   (18, 35]
3        23.680 3.310    Male     No  ...    2    0.140     1   (18, 35]
4        24.590 3.610  Female     No  ...    4    0.147     1   (18, 35]
..          ...   ...     ...    ...  ...  ...      ...   ...        ...
239      29.030 5.920    Male     No  ...    3    0.204     1   (18, 35]
240      27.180 2.000  Female    Yes  ...    2    0.074     1   (18, 35]
241      22.670 2.000    Male    Yes  ...    2    0.088     1   (18, 35]
242      17.820 1.750    Male     No  ...    2    0.098     1    (3, 18]
243      18.780 3.000  Female     No  ...    2    0.160     1   (18, 35]

[244 rows x 10 columns]

In [ ]:
df.groupby(["sex", "time"])[["total_bill"]].mean()

               total_bill
sex    time
Male   Lunch       18.048
       Dinner      21.461
Female Lunch       16.339
       Dinner      19.213

In [ ]:
df_gp = df.groupby(["sex", "time"])[["total_bill"]].mean().reset_index() #Hacemos un reseteo de indices para poderlo guardan en una nueva columna con pivot

In [ ]:
df_gp

      sex    time  total_bill
0    Male   Lunch      18.048
1    Male  Dinner      21.461
2  Female   Lunch      16.339
3  Female  Dinner      19.213

In [ ]:
df_gp.pivot_table(values= "total_bill", index="sex", columns="time") #aqui realizamos la tabla dinamica donde le especificamos el indice y las columnas

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

![](https://pandas-docs.github.io/pandas-docs-travis/_images/reshaping_pivot.png)

Al realizar este proceso ocurren operaciones estadisticas internamente, por defecto la media

In [ ]:
df.pivot_table(values="total_bill", index="sex", columns="time") #aplicamos a todo el data frame

time    Lunch  Dinner
sex
Male   18.048  21.461
Female 16.339  19.213

Podemos cambiar el estadistico que deseamos calcular, para el siguiente ejemplo vamos a calcular la mediana

In [ ]:
df.pivot_table(values="total_bill", index="sex", columns="time", aggfunc=np.median)

time    Lunch  Dinner
sex
Male   16.580  19.630
Female 13.420  17.190

In [ ]:
df_pivot = df.pivot_table(values="total_bill", index="sex", columns="time", aggfunc= [np.median, np.std])
df_pivot

       median          std
time    Lunch Dinner Lunch Dinner
sex
Male   16.580 19.630 7.953  9.461
Female 13.420 17.190 7.501  8.202

In [ ]:
df_pivot.unstack() #aplicamos para deshacer las categorias

        time    sex
median  Lunch   Male     16.580
                Female   13.420
        Dinner  Male     19.630
                Female   17.190
std     Lunch   Male      7.953
                Female    7.501
        Dinner  Male      9.461
                Female    8.202
dtype: float64

In [ ]:
df_pivot.unstack().reset_index() #convertimos en un data frame

  level_0    time     sex      0
0  median   Lunch    Male 16.580
1  median   Lunch  Female 13.420
2  median  Dinner    Male 19.630
3  median  Dinner  Female 17.190
4     std   Lunch    Male  7.953
5     std   Lunch  Female  7.501
6     std  Dinner    Male  9.461
7     std  Dinner  Female  8.202